Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 40, 40, 128)       1280      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 20, 20, 128)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 20, 20, 128)       147584    
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 10, 10, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 10, 10, 128)       147584    
_________________________________________________________________
flatten_12 (Flatten)         (None, 12800)             0         
_________________________________________________________________
dense_28 (Dense)             (None, 128)               1638528   
_________________________________________________________________
dense_29 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_12 (Activation)   (None, 26)                0         
=================================================================
Total params: 1,938,330
Trainable params: 1,938,330
Non-trainable params: 0
_________________________________________________________________

Training time (total): 8743.7s
Training time (avg): 874.4s
Accuracy (total): 94.02%
Per category: 95%, 90%, 97%, 96%, 92%, 91%, 97%, 95%, 90%, 95%, 96%, 95%, 100%, 92%, 96%, 94%, 91%, 90%, 96%, 93%, 93%, 93%, 96%, 95%, 93%, 95%
