Model: "sequential_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 40, 40, 64)        640       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 20, 20, 64)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 20, 20, 64)        36928     
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 10, 10, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 10, 10, 64)        36928     
_________________________________________________________________
flatten_19 (Flatten)         (None, 6400)              0         
_________________________________________________________________
dense_45 (Dense)             (None, 64)                409664    
_________________________________________________________________
dense_46 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_19 (Activation)   (None, 26)                0         
=================================================================
Total params: 485,850
Trainable params: 485,850
Non-trainable params: 0
_________________________________________________________________

Training time (total): 3071.6s
Training time (avg): 307.2s
Accuracy (total): 92.68%
Per category: 95%, 90%, 95%, 96%, 90%, 89%, 95%, 93%, 88%, 93%, 94%, 94%, 100%, 86%, 94%, 91%, 94%, 94%, 95%, 93%, 89%, 85%, 94%, 96%, 94%, 93%
