Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 40, 40, 64)        640       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 20, 20, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 20, 20, 64)        36928     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 10, 10, 64)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 10, 10, 64)        36928     
_________________________________________________________________
flatten_6 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 64)                409664    
_________________________________________________________________
dense_14 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_6 (Activation)    (None, 26)                0         
=================================================================
Total params: 485,850
Trainable params: 485,850
Non-trainable params: 0
_________________________________________________________________

Training time (total): 3643.3s
Training time (avg): 364.3s
Accuracy (total): 99.90%
Per category: 100%, 100%, 100%, 99%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%
