Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 40, 40, 64)        640       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 20, 20, 64)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 20, 20, 64)        36928     
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 10, 10, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 10, 10, 64)        36928     
_________________________________________________________________
flatten_5 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 64)                409664    
_________________________________________________________________
dense_10 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_5 (Activation)    (None, 26)                0         
=================================================================
Total params: 485,850
Trainable params: 485,850
Non-trainable params: 0
_________________________________________________________________

Training time (total): 3549.9s
Training time (avg): 355.0s
Accuracy (total): 98.50%
Per category: 100%, 89%, 100%, 100%, 100%, 100%, 100%, 100%, 95%, 100%, 100%, 98%, 100%, 100%, 100%, 100%, 91%, 100%, 100%, 100%, 93%, 100%, 100%, 100%, 95%, 100%
