Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 40, 40, 128)       1280      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 20, 20, 128)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 20, 20, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 128)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 10, 10, 128)       147584    
_________________________________________________________________
flatten (Flatten)            (None, 12800)             0         
_________________________________________________________________
dense (Dense)                (None, 64)                819264    
_________________________________________________________________
dense_1 (Dense)              (None, 26)                1690      
_________________________________________________________________
activation (Activation)      (None, 26)                0         
=================================================================
Total params: 1,117,402
Trainable params: 1,117,402
Non-trainable params: 0
_________________________________________________________________

Training time (total): 6004.7s
Training time (avg): 600.5s
Accuracy (total): 93.46%
Per category: 96%, 92%, 95%, 95%, 88%, 91%, 96%, 94%, 90%, 94%, 95%, 93%, 100%, 92%, 96%, 93%, 90%, 89%, 95%, 95%, 93%, 92%, 94%, 96%, 90%, 94%
