Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 40, 40, 32)        320       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 20, 20, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 20, 20, 32)        9248      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 10, 10, 32)        9248      
_________________________________________________________________
flatten_5 (Flatten)          (None, 3200)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 32)                102432    
_________________________________________________________________
dense_12 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_5 (Activation)    (None, 26)                0         
=================================================================
Total params: 122,106
Trainable params: 122,106
Non-trainable params: 0
_________________________________________________________________

Training time (total): 1653.1s
Training time (avg): 165.3s
Accuracy (total): 99.95%
Per category: 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%
