Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 40, 40, 32)        320       
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 20, 20, 32)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 20, 20, 32)        9248      
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 10, 10, 32)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 10, 10, 32)        9248      
_________________________________________________________________
flatten_6 (Flatten)          (None, 3200)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 32)                102432    
_________________________________________________________________
dense_12 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_6 (Activation)    (None, 26)                0         
=================================================================
Total params: 122,106
Trainable params: 122,106
Non-trainable params: 0
_________________________________________________________________

Training time (total): 1552.0s
Training time (avg): 155.2s
Accuracy (total): 98.29%
Per category: 100%, 92%, 100%, 100%, 97%, 100%, 100%, 100%, 93%, 100%, 100%, 99%, 100%, 97%, 99%, 100%, 93%, 95%, 100%, 100%, 96%, 97%, 100%, 100%, 97%, 100%
