Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 40, 40, 32)        320       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 20, 20, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 20, 20, 32)        9248      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 10, 10, 32)        9248      
_________________________________________________________________
flatten_2 (Flatten)          (None, 3200)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                102432    
_________________________________________________________________
dense_4 (Dense)              (None, 26)                858       
_________________________________________________________________
activation_2 (Activation)    (None, 26)                0         
=================================================================
Total params: 122,106
Trainable params: 122,106
Non-trainable params: 0
_________________________________________________________________

Training time (total): 1324.5s
Training time (avg): 132.5s
Accuracy (total-jitter-confuse): 87.67%
Per category: 84%, 82%, 94%, 92%, 90%, 84%, 93%, 91%, 79%, 90%, 93%, 83%, 100%, 87%, 81%, 85%, 89%, 87%, 95%, 88%, 79%, 81%, 80%, 90%, 89%, 93%
