Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_11 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_22 (Dense)             (None, 64)                102464    
_________________________________________________________________
dense_23 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_24 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_11 (Activation)   (None, 26)                0         
=================================================================
Total params: 108,314
Trainable params: 108,314
Non-trainable params: 0
_________________________________________________________________

Training time (total): 174.8s
Training time (avg): 17.5s
Accuracy (total): 98.23%
Per category: 100%, 100%, 100%, 100%, 88%, 100%, 100%, 100%, 94%, 100%, 100%, 96%, 100%, 100%, 100%, 100%, 90%, 100%, 100%, 100%, 93%, 93%, 100%, 100%, 100%, 100%
