Model: "sequential_25"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_25 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_54 (Dense)             (None, 64)                102464    
_________________________________________________________________
dense_55 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_56 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_25 (Activation)   (None, 26)                0         
=================================================================
Total params: 108,314
Trainable params: 108,314
Non-trainable params: 0
_________________________________________________________________

Training time (total): 177.4s
Training time (avg): 17.7s
Accuracy (total): 98.22%
Per category: 100%, 99%, 98%, 100%, 99%, 96%, 99%, 99%, 91%, 96%, 99%, 95%, 100%, 99%, 98%, 97%, 100%, 98%, 100%, 98%, 98%, 98%, 100%, 100%, 99%, 98%
