Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_17 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_40 (Dense)             (None, 32)                51232     
_________________________________________________________________
dense_41 (Dense)             (None, 32)                1056      
_________________________________________________________________
dense_42 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_17 (Activation)   (None, 26)                0         
=================================================================
Total params: 53,146
Trainable params: 53,146
Non-trainable params: 0
_________________________________________________________________

Training time (total): 118.6s
Training time (avg): 11.9s
Accuracy (total): 69.76%
Per category: 57%, 71%, 74%, 74%, 66%, 72%, 76%, 72%, 59%, 64%, 74%, 54%, 100%, 68%, 74%, 63%, 67%, 66%, 74%, 82%, 60%, 63%, 76%, 72%, 65%, 71%
