Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_15 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_34 (Dense)             (None, 128)               204928    
_________________________________________________________________
dense_35 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_36 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_15 (Activation)   (None, 26)                0         
=================================================================
Total params: 224,794
Trainable params: 224,794
Non-trainable params: 0
_________________________________________________________________

Training time (total): 248.2sTraining time (avg): 24.8sAccuracy (total): 75.55%
Per category: 66%, 80%, 82%, 76%, 72%, 75%, 75%, 77%, 65%, 76%, 86%, 66%, 100%, 75%, 80%, 68%, 73%, 69%, 75%, 75%, 69%, 70%, 80%, 79%, 71%, 82%
