Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_2 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 128)               204928    
_________________________________________________________________
dense_7 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_8 (Dense)              (None, 26)                3354      
_________________________________________________________________
activation_2 (Activation)    (None, 26)                0         
=================================================================
Total params: 224,794
Trainable params: 224,794
Non-trainable params: 0
_________________________________________________________________

Training time (total): 332.7s
Training time (avg): 33.3s
Accuracy (total): 98.42%
Per category: 99%, 98%, 99%, 100%, 99%, 95%, 100%, 100%, 94%, 96%, 100%, 97%, 100%, 98%, 98%, 100%, 99%, 95%, 99%, 98%, 99%, 98%, 100%, 100%, 99%, 99%
