Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_16 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_37 (Dense)             (None, 64)                102464    
_________________________________________________________________
dense_38 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_39 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_16 (Activation)   (None, 26)                0         
=================================================================
Total params: 108,314
Trainable params: 108,314
Non-trainable params: 0
_________________________________________________________________

Training time (total): 193.5s
Training time (avg): 19.4s
Accuracy (total): 73.08%
Per category: 66%, 75%, 76%, 77%, 67%, 71%, 70%, 74%, 65%, 70%, 85%, 70%, 99%, 80%, 70%, 61%, 72%, 72%, 75%, 71%, 69%, 70%, 78%, 76%, 65%, 73%
