Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_2 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 128)               204928    
_________________________________________________________________
dense_5 (Dense)              (None, 26)                3354      
_________________________________________________________________
activation_2 (Activation)    (None, 26)                0         
=================================================================
Total params: 208,282
Trainable params: 208,282
Non-trainable params: 0
_________________________________________________________________

Accuracy (total): 72.88%
Per category: 66%, 74%, 75%, 82%, 69%, 73%, 75%, 72%, 59%, 71%, 85%, 67%, 100%, 69%, 75%, 63%, 73%, 74%, 72%, 73%, 65%, 63%, 79%, 78%, 67%, 75%
