Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_3 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 64)                102464    
_________________________________________________________________
dense_7 (Dense)              (None, 26)                1690      
_________________________________________________________________
activation_3 (Activation)    (None, 26)                0         
=================================================================
Total params: 104,154
Trainable params: 104,154
Non-trainable params: 0
_________________________________________________________________

Accuracy (total): 70.10%
Per category: 68%, 74%, 75%, 80%, 72%, 65%, 73%, 71%, 58%, 62%, 83%, 64%, 100%, 68%, 74%, 60%, 74%, 65%, 74%, 69%, 68%, 67%, 68%, 65%, 63%, 65%
