Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_3 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               204928    
_________________________________________________________________
dense_8 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_9 (Dense)              (None, 26)                3354      
_________________________________________________________________
activation_3 (Activation)    (None, 26)                0         
=================================================================
Total params: 224,794
Trainable params: 224,794
Non-trainable params: 0
_________________________________________________________________

Training time (total): 337.5s
Training time (avg): 33.7s
Accuracy (total): 97.82%
Per category: 100%, 89%, 100%, 90%, 100%, 100%, 98%, 100%, 95%, 100%, 100%, 97%, 100%, 91%, 99%, 100%, 100%, 89%, 100%, 100%, 100%, 100%, 100%, 100%, 95%, 100%
