Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                51232     
_________________________________________________________________
dense_3 (Dense)              (None, 26)                858       
_________________________________________________________________
activation_1 (Activation)    (None, 26)                0         
=================================================================
Total params: 52,090
Trainable params: 52,090
Non-trainable params: 0
_________________________________________________________________

Accuracy (total): 65.74%
Per category: 61%, 69%, 63%, 73%, 60%, 58%, 61%, 69%, 49%, 68%, 95%, 62%, 100%, 64%, 71%, 55%, 59%, 57%, 63%, 66%, 67%, 59%, 73%, 65%, 60%, 64%
