Model: "sequential_24"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_24 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_51 (Dense)             (None, 32)                51232     
_________________________________________________________________
dense_52 (Dense)             (None, 32)                1056      
_________________________________________________________________
dense_53 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_24 (Activation)   (None, 26)                0         
=================================================================
Total params: 53,146
Trainable params: 53,146
Non-trainable params: 0
_________________________________________________________________

Training time (total): 119.3s
Training time (avg): 11.9s
Accuracy (total): 97.38%
Per category: 97%, 98%, 97%, 98%, 99%, 95%, 99%, 98%, 80%, 98%, 99%, 98%, 100%, 98%, 98%, 99%, 100%, 96%, 98%, 98%, 97%, 97%, 99%, 99%, 99%, 99%
