Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_10 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_19 (Dense)             (None, 32)                51232     
_________________________________________________________________
dense_20 (Dense)             (None, 32)                1056      
_________________________________________________________________
dense_21 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_10 (Activation)   (None, 26)                0         
=================================================================
Total params: 53,146
Trainable params: 53,146
Non-trainable params: 0
_________________________________________________________________

Training time (total): 116.7s
Training time (avg): 11.7s
Accuracy (total): 96.70%
Per category: 94%, 92%, 95%, 100%, 88%, 92%, 100%, 100%, 95%, 97%, 100%, 95%, 100%, 87%, 96%, 100%, 100%, 100%, 100%, 100%, 91%, 100%, 100%, 100%, 94%, 100%
