Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 40, 40, 32)        320       
_________________________________________________________________
batch_normalization (BatchNo (None, 40, 40, 32)        128       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 20, 20, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 20, 20, 32)        9248      
_________________________________________________________________
batch_normalization_1 (Batch (None, 20, 20, 32)        128       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 10, 10, 32)        9248      
_________________________________________________________________
batch_normalization_2 (Batch (None, 10, 10, 32)        128       
_________________________________________________________________
flatten (Flatten)            (None, 3200)              0         
_________________________________________________________________
dense (Dense)                (None, 32)                102432    
_________________________________________________________________
batch_normalization_3 (Batch (None, 32)                128       
_________________________________________________________________
dense_1 (Dense)              (None, 26)                858       
_________________________________________________________________
activation (Activation)      (None, 26)                0         
=================================================================
Total params: 122,618
Trainable params: 122,362
Non-trainable params: 256
_________________________________________________________________

Training time (total): 2012.1s
Training time (avg): 201.2s
Accuracy (total): 90.79%
Per category: 95%, 88%, 96%, 94%, 88%, 91%, 92%, 92%, 86%, 92%, 94%, 79%, 100%, 88%, 88%, 89%, 96%, 87%, 93%, 91%, 88%, 83%, 92%, 93%, 91%, 95%
