Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 40, 40, 128)       1280      
_________________________________________________________________
batch_normalization_3 (Batch (None, 40, 40, 128)       512       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 20, 20, 128)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 20, 20, 128)       147584    
_________________________________________________________________
batch_normalization_4 (Batch (None, 20, 20, 128)       512       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 128)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 10, 10, 128)       147584    
_________________________________________________________________
batch_normalization_5 (Batch (None, 10, 10, 128)       512       
_________________________________________________________________
flatten_4 (Flatten)          (None, 12800)             0         
_________________________________________________________________
dense_12 (Dense)             (None, 128)               1638528   
_________________________________________________________________
batch_normalization_6 (Batch (None, 128)               512       
_________________________________________________________________
dense_13 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_4 (Activation)    (None, 26)                0         
=================================================================
Total params: 1,940,378
Trainable params: 1,939,354
Non-trainable params: 1,024
_________________________________________________________________

Training time (total): 10856.2s
Training time (avg): 1085.6s
Accuracy (total): 99.99%
Per category: 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%
