Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 40, 40, 128)       1280      
_________________________________________________________________
batch_normalization (BatchNo (None, 40, 40, 128)       512       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 20, 20, 128)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 20, 20, 128)       147584    
_________________________________________________________________
batch_normalization_1 (Batch (None, 20, 20, 128)       512       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 10, 10, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 10, 10, 128)       147584    
_________________________________________________________________
batch_normalization_2 (Batch (None, 10, 10, 128)       512       
_________________________________________________________________
flatten_3 (Flatten)          (None, 12800)             0         
_________________________________________________________________
dense_5 (Dense)              (None, 128)               1638528   
_________________________________________________________________
batch_normalization_3 (Batch (None, 128)               512       
_________________________________________________________________
dense_6 (Dense)              (None, 26)                3354      
_________________________________________________________________
activation_3 (Activation)    (None, 26)                0         
=================================================================
Total params: 1,940,378
Trainable params: 1,939,354
Non-trainable params: 1,024
_________________________________________________________________

Training time (total): 7807.6s
Training time (avg): 780.8s
Accuracy (total-jitter-confuse): 93.11%
Per category: 96%, 92%, 97%, 95%, 89%, 91%, 96%, 94%, 88%, 93%, 93%, 93%, 100%, 89%, 96%, 93%, 94%, 93%, 94%, 93%, 87%, 88%, 94%, 95%, 94%, 95%
