Model: "sequential_26"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 40, 40, 64)        640       
_________________________________________________________________
batch_normalization_19 (Batc (None, 40, 40, 64)        256       
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 20, 20, 64)        0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 20, 20, 64)        36928     
_________________________________________________________________
batch_normalization_20 (Batc (None, 20, 20, 64)        256       
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 10, 10, 64)        0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 10, 10, 64)        36928     
_________________________________________________________________
batch_normalization_21 (Batc (None, 10, 10, 64)        256       
_________________________________________________________________
flatten_26 (Flatten)         (None, 6400)              0         
_________________________________________________________________
dense_57 (Dense)             (None, 64)                409664    
_________________________________________________________________
batch_normalization_22 (Batc (None, 64)                256       
_________________________________________________________________
dense_58 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_26 (Activation)   (None, 26)                0         
=================================================================
Total params: 486,874
Trainable params: 486,362
Non-trainable params: 512
_________________________________________________________________

Training time (total): 4166.6s
Training time (avg): 416.7s
Accuracy (total): 100.00%
Per category: 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%
