Model: "sequential_27"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_21 (Conv2D)           (None, 40, 40, 32)        320       
_________________________________________________________________
batch_normalization_23 (Batc (None, 40, 40, 32)        128       
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 20, 20, 32)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 20, 20, 32)        9248      
_________________________________________________________________
batch_normalization_24 (Batc (None, 20, 20, 32)        128       
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 10, 10, 32)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 10, 10, 32)        9248      
_________________________________________________________________
batch_normalization_25 (Batc (None, 10, 10, 32)        128       
_________________________________________________________________
flatten_27 (Flatten)         (None, 3200)              0         
_________________________________________________________________
dense_59 (Dense)             (None, 32)                102432    
_________________________________________________________________
batch_normalization_26 (Batc (None, 32)                128       
_________________________________________________________________
dense_60 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_27 (Activation)   (None, 26)                0         
=================================================================
Total params: 122,618
Trainable params: 122,362
Non-trainable params: 256
_________________________________________________________________

Training time (total): 1985.9s
Training time (avg): 198.6s
Accuracy (total): 99.99%
Per category: 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%, 100%
