Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 40, 40, 64)        640       
_________________________________________________________________
batch_normalization_4 (Batch (None, 40, 40, 64)        256       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 20, 20, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 20, 20, 64)        36928     
_________________________________________________________________
batch_normalization_5 (Batch (None, 20, 20, 64)        256       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 10, 10, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 10, 10, 64)        36928     
_________________________________________________________________
batch_normalization_6 (Batch (None, 10, 10, 64)        256       
_________________________________________________________________
flatten_1 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                409664    
_________________________________________________________________
batch_normalization_7 (Batch (None, 64)                256       
_________________________________________________________________
dense_3 (Dense)              (None, 26)                1690      
_________________________________________________________________
activation_1 (Activation)    (None, 26)                0         
=================================================================
Total params: 486,874
Trainable params: 486,362
Non-trainable params: 512
_________________________________________________________________

Training time (total): 4122.0s
Training time (avg): 412.2s
Accuracy (total): 92.14%
Per category: 94%, 91%, 96%, 95%, 90%, 89%, 97%, 93%, 92%, 91%, 93%, 87%, 100%, 90%, 93%, 91%, 94%, 87%, 89%, 94%, 89%, 86%, 96%, 95%, 93%, 92%
