Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 40, 40, 32)        320       
_________________________________________________________________
batch_normalization_2 (Batch (None, 40, 40, 32)        128       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 20, 20, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 20, 20, 32)        9248      
_________________________________________________________________
batch_normalization_3 (Batch (None, 20, 20, 32)        128       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 10, 10, 32)        9248      
_________________________________________________________________
batch_normalization_4 (Batch (None, 10, 10, 32)        128       
_________________________________________________________________
flatten_2 (Flatten)          (None, 3200)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 32)                102432    
_________________________________________________________________
batch_normalization_5 (Batch (None, 32)                128       
_________________________________________________________________
dense_6 (Dense)              (None, 26)                858       
_________________________________________________________________
activation_2 (Activation)    (None, 26)                0         
=================================================================
Total params: 122,618
Trainable params: 122,362
Non-trainable params: 256
_________________________________________________________________

Training time (total): 2289.9s
Training time (avg): 229.0s
Accuracy (total): 98.08%
Per category: 100%, 100%, 100%, 100%, 88%, 100%, 97%, 100%, 93%, 100%, 100%, 99%, 100%, 97%, 100%, 98%, 94%, 100%, 100%, 96%, 93%, 98%, 100%, 100%, 97%, 100%
