Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 40, 40, 64)        640       
_________________________________________________________________
batch_normalization_8 (Batch (None, 40, 40, 64)        256       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 20, 20, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 20, 20, 64)        36928     
_________________________________________________________________
batch_normalization_9 (Batch (None, 20, 20, 64)        256       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 10, 10, 64)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 10, 10, 64)        36928     
_________________________________________________________________
batch_normalization_10 (Batc (None, 10, 10, 64)        256       
_________________________________________________________________
flatten_3 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 64)                409664    
_________________________________________________________________
batch_normalization_11 (Batc (None, 64)                256       
_________________________________________________________________
dense_6 (Dense)              (None, 26)                1690      
_________________________________________________________________
activation_3 (Activation)    (None, 26)                0         
=================================================================
Total params: 486,874
Trainable params: 486,362
Non-trainable params: 512
_________________________________________________________________

Training time (total): 3899.5s
Training time (avg): 389.9s
Accuracy (total): 98.39%
Per category: 100%, 92%, 100%, 100%, 97%, 100%, 100%, 100%, 95%, 100%, 100%, 98%, 100%, 91%, 100%, 100%, 100%, 92%, 100%, 100%, 98%, 98%, 100%, 100%, 97%, 100%
