Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_8 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_18 (Dense)             (None, 64)                102464    
_________________________________________________________________
dense_19 (Dense)             (None, 64)                4160      
_________________________________________________________________
batch_normalization_4 (Batch (None, 64)                256       
_________________________________________________________________
dense_20 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_8 (Activation)    (None, 26)                0         
=================================================================
Total params: 108,570
Trainable params: 108,442
Non-trainable params: 128
_________________________________________________________________

Training time (total): 2052.4s
Training time (avg): 20.5s
Accuracy (total): 80.52%
Per category: 76%, 80%, 84%, 84%, 75%, 76%, 83%, 84%, 72%, 82%, 85%, 71%, 100%, 82%, 76%, 76%, 84%, 82%, 82%, 80%, 72%, 76%, 88%, 85%, 73%, 86%
