Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_17 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_37 (Dense)             (None, 64)                102464    
_________________________________________________________________
dense_38 (Dense)             (None, 64)                4160      
_________________________________________________________________
batch_normalization_17 (Batc (None, 64)                256       
_________________________________________________________________
dense_39 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_17 (Activation)   (None, 26)                0         
=================================================================
Total params: 108,570
Trainable params: 108,442
Non-trainable params: 128
_________________________________________________________________

Training time (total): 187.5s
Training time (avg): 18.7s
Accuracy (total): 97.33%
Per category: 98%, 97%, 98%, 100%, 91%, 100%, 100%, 100%, 89%, 100%, 100%, 98%, 100%, 100%, 95%, 95%, 90%, 100%, 100%, 100%, 91%, 92%, 100%, 100%, 97%, 100%
