Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten (Flatten)            (None, 1600)              0         
_________________________________________________________________
dense (Dense)                (None, 32)                51232     
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
dense_2 (Dense)              (None, 26)                858       
_________________________________________________________________
activation (Activation)      (None, 26)                0         
=================================================================
Total params: 53,274
Trainable params: 53,210
Non-trainable params: 64
_________________________________________________________________

Training time (total): 148.7s
Training time (avg): 14.9s
Accuracy (total): 66.74%
Per category: 54%, 78%, 66%, 73%, 68%, 57%, 62%, 62%, 57%, 60%, 84%, 64%, 99%, 65%, 73%, 59%, 68%, 64%, 65%, 61%, 61%, 60%, 73%, 67%, 60%, 75%
