Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_9 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_21 (Dense)             (None, 128)               204928    
_________________________________________________________________
dense_22 (Dense)             (None, 128)               16512     
_________________________________________________________________
batch_normalization_5 (Batch (None, 128)               512       
_________________________________________________________________
dense_23 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_9 (Activation)    (None, 26)                0         
=================================================================
Total params: 225,306
Trainable params: 225,050
Non-trainable params: 256
_________________________________________________________________

Training time (total): 1378.6sTraining time (avg): 27.6sAccuracy (total): 80.65%
Per category: 77%, 76%, 84%, 88%, 87%, 76%, 85%, 78%, 69%, 79%, 79%, 76%, 100%, 79%, 78%, 77%, 88%, 79%, 85%, 82%, 75%, 71%, 86%, 83%, 79%, 83%
