Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_15 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_31 (Dense)             (None, 32)                51232     
_________________________________________________________________
dense_32 (Dense)             (None, 32)                1056      
_________________________________________________________________
batch_normalization_15 (Batc (None, 32)                128       
_________________________________________________________________
dense_33 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_15 (Activation)   (None, 26)                0         
=================================================================
Total params: 53,274
Trainable params: 53,210
Non-trainable params: 64
_________________________________________________________________

Training time (total): 124.7s
Training time (avg): 12.5s
Accuracy (total): 94.39%
Per category: 100%, 100%, 99%, 100%, 88%, 100%, 100%, 100%, 87%, 100%, 100%, 89%, 100%, 100%, 84%, 97%, 90%, 100%, 100%, 100%, 88%, 73%, 96%, 93%, 76%, 97%
