Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_14 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_29 (Dense)             (None, 128)               204928    
_________________________________________________________________
batch_normalization_14 (Batc (None, 128)               512       
_________________________________________________________________
dense_30 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_14 (Activation)   (None, 26)                0         
=================================================================
Total params: 208,794
Trainable params: 208,538
Non-trainable params: 256
_________________________________________________________________

Training time (total): 225.6s
Training time (avg): 22.6s
Accuracy (total): 91.90%
Per category: 78%, 89%, 100%, 100%, 99%, 95%, 97%, 100%, 84%, 98%, 100%, 80%, 100%, 93%, 84%, 75%, 91%, 98%, 98%, 100%, 82%, 90%, 100%, 82%, 80%, 97%
