Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_12 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_25 (Dense)             (None, 64)                102464    
_________________________________________________________________
batch_normalization_12 (Batc (None, 64)                256       
_________________________________________________________________
dense_26 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_12 (Activation)   (None, 26)                0         
=================================================================
Total params: 104,410
Trainable params: 104,282
Non-trainable params: 128
_________________________________________________________________

Training time (total): 179.4s
Training time (avg): 17.9s
Accuracy (total): 91.46%
Per category: 90%, 89%, 97%, 98%, 95%, 88%, 98%, 100%, 86%, 88%, 100%, 77%, 100%, 94%, 84%, 73%, 97%, 87%, 92%, 100%, 96%, 80%, 95%, 98%, 78%, 97%
