Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_13 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_27 (Dense)             (None, 128)               204928    
_________________________________________________________________
batch_normalization_13 (Batc (None, 128)               512       
_________________________________________________________________
dense_28 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_13 (Activation)   (None, 26)                0         
=================================================================
Total params: 208,794
Trainable params: 208,538
Non-trainable params: 256
_________________________________________________________________

Training time (total): 231.5s
Training time (avg): 23.1s
Accuracy (total): 93.32%
Per category: 80%, 95%, 100%, 98%, 91%, 100%, 100%, 100%, 88%, 94%, 100%, 81%, 100%, 91%, 87%, 93%, 100%, 100%, 98%, 96%, 80%, 72%, 96%, 99%, 90%, 100%
