Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_13 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_30 (Dense)             (None, 32)                51232     
_________________________________________________________________
batch_normalization_14 (Batc (None, 32)                128       
_________________________________________________________________
dense_31 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_13 (Activation)   (None, 26)                0         
=================================================================
Total params: 52,218
Trainable params: 52,154
Non-trainable params: 64
_________________________________________________________________

Training time (total): 125.1s
Training time (avg): 12.5s
Accuracy (total): 65.03%
Per category: 51%, 62%, 75%, 67%, 67%, 70%, 63%, 67%, 52%, 55%, 70%, 53%, 100%, 64%, 69%, 59%, 71%, 65%, 67%, 68%, 60%, 55%, 70%, 64%, 61%, 66%
