Model: "sequential_30"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_30 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_65 (Dense)             (None, 128)               204928    
_________________________________________________________________
batch_normalization_29 (Batc (None, 128)               512       
_________________________________________________________________
dense_66 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_30 (Activation)   (None, 26)                0         
=================================================================
Total params: 208,794
Trainable params: 208,538
Non-trainable params: 256
_________________________________________________________________

Training time (total): 228.0s
Training time (avg): 22.8s
Accuracy (total): 98.70%
Per category: 100%, 99%, 99%, 100%, 99%, 98%, 100%, 100%, 91%, 96%, 100%, 96%, 100%, 99%, 96%, 100%, 100%, 98%, 100%, 99%, 100%, 99%, 100%, 100%, 100%, 99%
