Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                51232     
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
dense_4 (Dense)              (None, 26)                858       
_________________________________________________________________
activation_1 (Activation)    (None, 26)                0         
=================================================================
Total params: 52,218
Trainable params: 52,154
Non-trainable params: 64
_________________________________________________________________

Training time (total): 147.2s
Training time (avg): 14.7s
Accuracy (total): 90.30%
Per category: 82%, 100%, 100%, 100%, 80%, 94%, 100%, 94%, 78%, 100%, 100%, 74%, 100%, 97%, 86%, 83%, 94%, 98%, 84%, 96%, 73%, 77%, 91%, 100%, 70%, 97%
