Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_16 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_34 (Dense)             (None, 32)                51232     
_________________________________________________________________
dense_35 (Dense)             (None, 32)                1056      
_________________________________________________________________
batch_normalization_16 (Batc (None, 32)                128       
_________________________________________________________________
dense_36 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_16 (Activation)   (None, 26)                0         
=================================================================
Total params: 53,274
Trainable params: 53,210
Non-trainable params: 64
_________________________________________________________________

Training time (total): 124.9s
Training time (avg): 12.5s
Accuracy (total): 95.76%
Per category: 98%, 90%, 100%, 100%, 100%, 95%, 100%, 100%, 96%, 100%, 100%, 87%, 100%, 94%, 89%, 97%, 97%, 92%, 100%, 100%, 93%, 79%, 93%, 100%, 92%, 100%
