Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_3 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               204928    
_________________________________________________________________
dense_10 (Dense)             (None, 128)               16512     
_________________________________________________________________
batch_normalization_2 (Batch (None, 128)               512       
_________________________________________________________________
dense_11 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_3 (Activation)    (None, 26)                0         
=================================================================
Total params: 225,306
Trainable params: 225,050
Non-trainable params: 256
_________________________________________________________________

Training time (total): 354.2s
Training time (avg): 35.4s
Accuracy (total): 99.08%
Per category: 100%, 99%, 100%, 100%, 100%, 99%, 100%, 99%, 93%, 99%, 100%, 97%, 100%, 99%, 98%, 100%, 99%, 98%, 100%, 99%, 100%, 100%, 100%, 100%, 99%, 100%
