Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_7 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                102464    
_________________________________________________________________
dense_16 (Dense)             (None, 64)                4160      
_________________________________________________________________
batch_normalization_3 (Batch (None, 64)                256       
_________________________________________________________________
dense_17 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_7 (Activation)    (None, 26)                0         
=================================================================
Total params: 108,570
Trainable params: 108,442
Non-trainable params: 128
_________________________________________________________________

Training time (total): 391.9s
Training time (avg): 19.6s
Accuracy (total): 75.02%
Per category: 68%, 75%, 79%, 78%, 68%, 78%, 74%, 80%, 64%, 76%, 80%, 65%, 99%, 74%, 78%, 62%, 74%, 79%, 82%, 78%, 67%, 67%, 76%, 78%, 72%, 81%
