Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_14 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_32 (Dense)             (None, 64)                102464    
_________________________________________________________________
batch_normalization_15 (Batc (None, 64)                256       
_________________________________________________________________
dense_33 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_14 (Activation)   (None, 26)                0         
=================================================================
Total params: 104,410
Trainable params: 104,282
Non-trainable params: 128
_________________________________________________________________

Training time (total): 199.5s
Training time (avg): 19.9s
Accuracy (total): 66.55%
Per category: 60%, 64%, 67%, 77%, 64%, 71%, 62%, 66%, 54%, 60%, 75%, 61%, 100%, 72%, 71%, 56%, 71%, 61%, 70%, 65%, 60%, 58%, 68%, 66%, 60%, 74%
