Model: "sequential_28"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_28 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_61 (Dense)             (None, 32)                51232     
_________________________________________________________________
batch_normalization_27 (Batc (None, 32)                128       
_________________________________________________________________
dense_62 (Dense)             (None, 26)                858       
_________________________________________________________________
activation_28 (Activation)   (None, 26)                0         
=================================================================
Total params: 52,218
Trainable params: 52,154
Non-trainable params: 64
_________________________________________________________________

Training time (total): 124.4s
Training time (avg): 12.4s
Accuracy (total): 97.38%
Per category: 99%, 99%, 96%, 99%, 98%, 98%, 99%, 98%, 89%, 93%, 97%, 92%, 100%, 98%, 95%, 99%, 100%, 96%, 99%, 98%, 98%, 96%, 100%, 99%, 99%, 99%
