Model: "sequential_29"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_29 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_63 (Dense)             (None, 64)                102464    
_________________________________________________________________
batch_normalization_28 (Batc (None, 64)                256       
_________________________________________________________________
dense_64 (Dense)             (None, 26)                1690      
_________________________________________________________________
activation_29 (Activation)   (None, 26)                0         
=================================================================
Total params: 104,410
Trainable params: 104,282
Non-trainable params: 128
_________________________________________________________________

Training time (total): 180.7s
Training time (avg): 18.1s
Accuracy (total): 98.51%
Per category: 99%, 99%, 99%, 100%, 99%, 98%, 100%, 99%, 92%, 97%, 100%, 96%, 100%, 99%, 97%, 100%, 99%, 99%, 99%, 98%, 99%, 98%, 100%, 99%, 99%, 99%
