Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                102464    
_________________________________________________________________
dense_4 (Dense)              (None, 64)                4160      
_________________________________________________________________
batch_normalization_1 (Batch (None, 64)                256       
_________________________________________________________________
dense_5 (Dense)              (None, 26)                1690      
_________________________________________________________________
activation_1 (Activation)    (None, 26)                0         
=================================================================
Total params: 108,570
Trainable params: 108,442
Non-trainable params: 128
_________________________________________________________________

Training time (total): 259.0s
Training time (avg): 25.9s
Accuracy (total): 98.96%
Per category: 99%, 99%, 99%, 100%, 100%, 99%, 100%, 100%, 93%, 98%, 100%, 97%, 100%, 98%, 99%, 100%, 100%, 99%, 100%, 99%, 99%, 99%, 100%, 100%, 100%, 99%
