Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_6 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_12 (Dense)             (None, 128)               204928    
_________________________________________________________________
dense_13 (Dense)             (None, 128)               16512     
_________________________________________________________________
batch_normalization_2 (Batch (None, 128)               512       
_________________________________________________________________
dense_14 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_6 (Activation)    (None, 26)                0         
=================================================================
Total params: 225,306
Trainable params: 225,050
Non-trainable params: 256
_________________________________________________________________

Training time (total): 259.0s
Training time (avg): 25.9s
Accuracy (total): 75.10%
Per category: 64%, 72%, 85%, 74%, 78%, 75%, 77%, 81%, 73%, 68%, 76%, 67%, 100%, 69%, 76%, 67%, 74%, 78%, 84%, 79%, 67%, 68%, 79%, 78%, 70%, 74%
