Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_4 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                51232     
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
dense_9 (Dense)              (None, 26)                858       
_________________________________________________________________
activation_4 (Activation)    (None, 26)                0         
=================================================================
Total params: 52,218
Trainable params: 52,154
Non-trainable params: 64
_________________________________________________________________

Accuracy (total): 64.91%
Per category: 58%, 76%, 67%, 69%, 62%, 56%, 61%, 67%, 59%, 53%, 74%, 56%, 100%, 79%, 68%, 53%, 69%, 59%, 73%, 57%, 61%, 53%, 67%, 64%, 59%, 68%
