Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten (Flatten)            (None, 1600)              0         
_________________________________________________________________
dense (Dense)                (None, 32)                51232     
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
dense_2 (Dense)              (None, 26)                858       
_________________________________________________________________
activation (Activation)      (None, 26)                0         
=================================================================
Total params: 53,274
Trainable params: 53,210
Non-trainable params: 64
_________________________________________________________________

Training time (total): 132.4s
Training time (avg): 13.2s
Accuracy (total): 98.04%
Per category: 99%, 99%, 99%, 100%, 98%, 96%, 93%, 99%, 91%, 98%, 100%, 95%, 100%, 99%, 96%, 100%, 100%, 96%, 99%, 98%, 100%, 99%, 100%, 99%, 98%, 99%
