Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_5 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               204928    
_________________________________________________________________
batch_normalization_1 (Batch (None, 128)               512       
_________________________________________________________________
dense_11 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_5 (Activation)    (None, 26)                0         
=================================================================
Total params: 208,794
Trainable params: 208,538
Non-trainable params: 256
_________________________________________________________________

Accuracy (total): 69.65%
Per category: 66%, 65%, 73%, 73%, 69%, 78%, 74%, 76%, 58%, 60%, 62%, 61%, 100%, 60%, 75%, 58%, 68%, 72%, 79%, 58%, 67%, 65%, 73%, 76%, 68%, 75%
