Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_18 (Flatten)         (None, 1600)              0         
_________________________________________________________________
dense_40 (Dense)             (None, 128)               204928    
_________________________________________________________________
dense_41 (Dense)             (None, 128)               16512     
_________________________________________________________________
batch_normalization_18 (Batc (None, 128)               512       
_________________________________________________________________
dense_42 (Dense)             (None, 26)                3354      
_________________________________________________________________
activation_18 (Activation)   (None, 26)                0         
=================================================================
Total params: 225,306
Trainable params: 225,050
Non-trainable params: 256
_________________________________________________________________

Training time (total): 242.4s
Training time (avg): 24.2s
Accuracy (total): 97.79%
Per category: 100%, 95%, 100%, 100%, 95%, 100%, 100%, 100%, 94%, 100%, 100%, 96%, 100%, 87%, 97%, 100%, 100%, 89%, 100%, 100%, 99%, 96%, 100%, 100%, 97%, 100%
